src/payload.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body><tns:PoslovniProstorZahtjev xmlns:tns="http://www.apis-it.hr/fin/2012/types/f73" Id="53c1ca853c10f">
 <tns:Zaglavlje>
  <tns:IdPoruke>14fca7d7-d440-424f-962c-1d3f1848cf1b</tns:IdPoruke>
  <tns:DatumVrijeme>13.07.2014T01:53:41</tns:DatumVrijeme>
 </tns:Zaglavlje>
 <tns:PoslovniProstor>
  <tns:Oib>32314900695</tns:Oib>
  <tns:OznPoslProstora>MAGE5</tns:OznPoslProstora>
  <tns:AdresniPodatak>
   <tns:Adresa>
    <tns:Ulica>Otokara Kersovanija 4</tns:Ulica>
    <tns:KucniBroj>45</tns:KucniBroj>
    <tns:KucniBrojDodatak>B</tns:KucniBrojDodatak>
    <tns:BrojPoste>31000</tns:BrojPoste>
    <tns:Naselje>Osijek</tns:Naselje>
    <tns:Opcina>Osijek</tns:Opcina>
   </tns:Adresa>
  </tns:AdresniPodatak>
  <tns:RadnoVrijeme>Pon-Sub: 08:00-21:00, Ned: 09:00-14:00</tns:RadnoVrijeme>
  <tns:DatumPocetkaPrimjene>04.01.2013</tns:DatumPocetkaPrimjene>
  <tns:SpecNamj>79343687407</tns:SpecNamj>
 </tns:PoslovniProstor>
<Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo xmlns="http://www.w3.org/2000/09/xmldsig#"><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><Reference URI="#53c1cb628cee8"><Transforms><Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>HNjqxIoTdca3yY5guVQ0UjemVbc=</DigestValue></Reference></SignedInfo><SignatureValue>XXt6yZ2waJfjQdAsUAZR0NM/KAC8wrksK3NX//L7KFEPuC9iTzmFnf0MYD5OgKoQJxRGRjaBegR3cLT/wjmpD9AF0/lJGcF8qn0n/hPc1ROTsciNHyKo2F5H52TnvzsosGtJFTK3pzAvkVmyVLr8r+uYMJndVfDyxndHxefLb4CAj/j3P1oZ+B5KjxVaFdDOUd/akxecJ67T+LFI6RmiRbMpSes3oNa7uldQGjPRG6D1zNrs8WQvbXmU9nXpW0Q/kaKM9QOREFcA8OXz4ucPagNFz8EIklVV0BtvKl9FWzY/LVF4I2I8upa+JwHfeeBCAr0HOW8KBwfdbQnQ8QbPcA==</SignatureValue><KeyInfo><X509Data><X509Certificate>
MIIE4DCCA8igAwIBAgIEPstKFDANBgkqhkiG9w0BAQUFADArMQswCQYDVQQGEwJI
UjENMAsGA1UEChMERklOQTENMAsGA1UECxMEREVNTzAeFw0xMzA1MjgxMzA3NTRa
Fw0xNTA1MjgxMzM3NTRaMFsxCzAJBgNVBAYTAkhSMSgwJgYDVQQKEx9UTlQgU1RV
RElPIEQuTy5PLiBIUjMyMzE0OTAwNjk1MQ8wDQYDVQQHEwZaQUdSRUIxETAPBgNV
BAMTCEZJU0tBTCAxMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEA7MPx
hvaUc8KeB98PQsJpPQFnYmuAhdFB3hERqIMlWYBla2WI2Kf6a90JsDBFK5FsSbIi
ZqCnNoFmeij6yfX/3gIc1X6ULK5o567x+RxK19kI58pFulvPmGXuV8uX1RW+QDqU
MaXYGCqX5cKx0giY9s6gmeLTemeLD9H+bjGLR6KeOTZSByDPsXw5zYamGUL+wC/q
Q6TMxPCE6d/45Nw0KnJk6quY+F9aAf9k5E82XdZ21cGqQc6To6/KP2gxGD0DJaF/
u0S9VEKy1C5g+JYlgY4W8Gi9by6TGuTI/bEh6TNzxCVAHtM1wdoPjaiJAVwgfySu
uZbh+DvMIg2zjv44lwIDAQABo4IB2jCCAdYwCwYDVR0PBAQDAgWgMEIGA1UdIAQ7
MDkwNwYJK3yIUAUfBQMBMCowKAYIKwYBBQUHAgEWHGh0dHA6Ly9kZW1vLXBraS5m
aW5hLmhyL2Nwcy8wHgYDVR0RBBcwFYETc2FzYXRva2ljQGdtYWlsLmNvbTCBzwYD
VR0fBIHHMIHEMEOgQaA/pD0wOzELMAkGA1UEBhMCSFIxDTALBgNVBAoTBEZJTkEx
DTALBgNVBAsTBERFTU8xDjAMBgNVBAMTBUNSTDExMH2ge6B5hk9sZGFwOi8vZGVt
by1sZGFwLmZpbmEuaHIvb3U9REVNTyxvPUZJTkEsYz1IUj9jZXJ0aWZpY2F0ZVJl
dm9jYXRpb25MaXN0JTNCYmluYXJ5hiZodHRwOi8vZGVtby1wa2kuZmluYS5oci9j
cmwvZGVtb2NhLmNybDArBgNVHRAEJDAigA8yMDEzMDUyODEzMDc1NFqBDzIwMTUw
NTI4MTMzNzU0WjAfBgNVHSMEGDAWgBR6YCOOSJ0ya6TlLd24WbSU/EJinjAdBgNV
HQ4EFgQU4A+7iIvqpu00KoqZRyFHgcI+P68wCQYDVR0TBAIwADAZBgkqhkiG9n0H
QQAEDDAKGwRWOC4xAwIDqDANBgkqhkiG9w0BAQUFAAOCAQEAJGrAMAtD73fgZ08P
T4bOEArFOHr7PgByphefg2ZAycDWDw/d5YcpElYxQ3lCKdG9+KmeypPJPMnq3JnI
4k90i70rnr7VgXuFattRZxUl9g1TEY3nrdXovxBea+EhvmAEdLzO9FbneKEh4h0v
jFJobdhCuApbgibBr1Kreo2mDZtwnJv/V9woUGlMM8WObZ3AdGGps9dpVgKu2Rjt
33jQnQI3YDtTYU4hXSMn19CheMSmRMzQiiAJrXIEAXHygrZGHqJRXlZjZmFAi84G
ntcpAYmu2iv7XzlOmJlsikjs9tXYOCSFtIv+1WH0sut31tgerMG0QrWXNc5RmuSy
JRlIfQ==

</X509Certificate><X509IssuerSerial><X509IssuerName>OU=DEMO,O=FINA,C=HR</X509IssuerName><X509SerialNumber>1053510164</X509SerialNumber></X509IssuerSerial></X509Data></KeyInfo></Signature></tns:PoslovniProstorZahtjev></soapenv:Body>
</soapenv:Envelope>
