tornado/data/9.2_Poruka_zahtjeva_za_racun_certifikat.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Body>
<tns:RacunZahtjev xmlns:tns="http://www.apis-it.hr/fin/2012/types/f73"
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" Id="racunId"
xsi:schemaLocation="http://www.apis-it.hr/fin/2012/types/f73 ../schema/FiskalizacijaSchema.xsd">
<tns:Zaglavlje>
<tns:IdPoruke>f81d4fae-7dec-11d0-a765-00a0c91e6bf6</tns:IdPoruke>
<tns:DatumVrijeme>01.09.2012T21:10:34</tns:DatumVrijeme>
</tns:Zaglavlje>
<tns:Racun>
<tns:Oib>98765432198</tns:Oib>
<tns:USustPdv>true</tns:USustPdv>
<tns:DatVrijeme>01.09.2012T21:10:34</tns:DatVrijeme>
<tns:OznSlijed>P</tns:OznSlijed>
<tns:BrRac>
<tns:BrOznRac>123456789</tns:BrOznRac>
<tns:OznPosPr>POSL1</tns:OznPosPr>
<tns:OznNapUr>12</tns:OznNapUr>
</tns:BrRac>
<tns:Pdv>
<tns:Porez>
<tns:Stopa>25.00</tns:Stopa>
<tns:Osnovica>10.00</tns:Osnovica>
<tns:Iznos>2.50</tns:Iznos>
</tns:Porez>
<tns:Porez>
<tns:Stopa>10.00</tns:Stopa>
<tns:Osnovica>10.00</tns:Osnovica>
<tns:Iznos>1.00</tns:Iznos>
</tns:Porez>
<tns:Porez>
<tns:Stopa>0.00</tns:Stopa>
<tns:Osnovica>10.00</tns:Osnovica>
<tns:Iznos>0.00</tns:Iznos>
</tns:Porez>
</tns:Pdv>
<tns:Pnp>
<tns:Porez>
<tns:Stopa>3.00</tns:Stopa>
<tns:Osnovica>10.00</tns:Osnovica>
<tns:Iznos>0.30</tns:Iznos>
</tns:Porez>
</tns:Pnp>
<tns:OstaliPor>
<tns:Porez>
<tns:Naziv>Porez na luksuz</tns:Naziv>
<tns:Stopa>15.00</tns:Stopa>
<tns:Osnovica>10.00</tns:Osnovica>
<tns:Iznos>1.50</tns:Iznos>
</tns:Porez>
</tns:OstaliPor>
<tns:IznosOslobPdv>12.00</tns:IznosOslobPdv>
<tns:IznosMarza>13.00</tns:IznosMarza>
<tns:IznosNePodlOpor>100.00</tns:IznosNePodlOpor>
<tns:Naknade>
<tns:Naknada>
<tns:NazivN>Povratna naknada</tns:NazivN>
<tns:IznosN>1.00</tns:IznosN>
</tns:Naknada>
</tns:Naknade>
<tns:IznosUkupno>145.68</tns:IznosUkupno>
<tns:NacinPlac>K</tns:NacinPlac>
<tns:OibOper>01234567890</tns:OibOper>
<tns:ZastKod>e4d909c290d0fb1ca068ffaddf22cbd0</tns:ZastKod>
<tns:NakDost>false</tns:NakDost>
<tns:ParagonBrRac>123/458/5</tns:ParagonBrRac>
<tns:SpecNamj>Navedeno kao primjer</tns:SpecNamj>
</tns:Racun>
<Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
<SignedInfo>
<CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
<SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<Reference URI="#racunId">
<Transforms>
<Transform Algorithm="http://www.w3.org/2000/09/xmldsig#envelopedsignature"/>
<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</Transforms>
<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<DigestValue>VItfxY/A1BITZ/BuWpsGd9gKix4=</DigestValue>
</Reference>
</SignedInfo>
<SignatureValue>0+5UDLzJuGy56HojH510+dX6VurJmL52Ob7FDNNH8U3Nltxlo7fUvU1ra6HPSyCd4H3O
QEvZIb3xv1yqvLGYr0M5yzVGbu9o4IXG3qlTTVtEWu1MCC7OYeyltnKwr9/QRAbFrA3QWZu/F8qnc4dKg6ohl
8X8hZLLh2wIzNxtOrzbtJO6lZciCyfptR6u1vvwmUxIlo7ISCTLXw/UC9LqC86C5HBbQU+QT1i9rTsUdYZZ0kT
el4Z/ZPkYO+OqZmpiKdSbwlwwqtp7CrQ0WK2RSd+x+XUf2GF3Ydld90Tx9QYRps/Z
P0OME3jnSpKJIkRQTB8ev9rM+KYYEGbSR1rz6g==
</SignatureValue>
<KeyInfo>
<X509Data>
<X509Certificate>MIIEyDCCA7CgAwIBAgIEPssQ2TANBgkqhkiG9w0BAQUFADArMQswCQYDVQQGEwJIUjE
NMAsGA1UEChMERklOQTENMAsGA1UECxMEREVNTzAeFw0xMjA5MjcxMDQ5MThaFw0xNDA5MjcxMTE5MT
haMFkxCzAJBgNVBAYTAkhSMSYwJAYDVQQKEx1BUElTIElUICBELk8uTy4gSFIwMjk5NDY1MDE5OTEPMA0G
A1UEBxMGWkFHUkVCMREwDwYDVQQDEwhGSVNLQUwgMjCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCA
QoCggEBAOEPIO7AMxdO5o6jw5BUy2UAKXdtdYavlEtVPVRwoBxA4YxPzDFjsnJGapAH4DW7YKqgLLLT6EjrK
kCvjOpgr5LsPUjZk7/gZrVNpcBIzm6ECiywBGjB623/kdWqYdd9Al+1KbOVa+PRp9D7JzjLQTZaXTc4FR5wGo
4w9jC22ixqb+F6aDzF6TLsICJVKFWV4g6glMLlKgsrZxk+O55/1f7o0442dCGuZ7IQtp1UK7TH9a7KilvLNv+1
OKyZDZfzYGyPVkB/Tt7N5NO0R1ICbeATvDcDyl2BQfECYC+z+3dfDybcOFF+QmBsntIKO4p7+LxR/Yob5/Gx
PrIi6KVyDdECAwEAAaOCAcQwggHAMAsGA1UdDwQEAwIFoDBCBgNVHSAEOzA5MDcGCSt8iFAFHwUDATAq
MCgGCCsGAQUFBwIBFhxodHRwOi8vZGVtby1wa2kuZmluYS5oci9jcHMvMCQGA1UdEQQdMBuBGXNhbmRy
YS5wb3BvdmljQGFwaXMtaXQuaHIwgc4GA1UdHwSBxjCBwzBCoECgPqQ8MDoxCzAJBgNVBAYTAkhSMQ0w
CwYDVQQKEwRGSU5BMQ0wCwYDVQQLEwRERU1PMQ0wCwYDVQQDEwRDUkw3MH2ge6B5hk9sZGFwOi8
vZGVtby1sZGFwLmZpbmEuaHIvb3U9REVNTyxvPUZJTkEsYz1IUj9jZXJ0aWZpY2F0ZVJldm9jYXRpb25MaXN0JTNCYmluYXJ5hiZodHRwOi8vZGVtby1wa2kuZmluYS5oci9jcmwvZGVtb2NhLmNybDArBgNVHRAEJDAig
A8yMDEyMDkyNzEwNDkxOFqBDzIwMTQwOTI3MTExOTE4WjAfBgNVHSMEGDAWgBR6YCOOSJ0ya6TlLd24
WbSU/EJinjAdBgNVHQ4EFgQUK/IWmnKEKdD/PLV06CddkYi7WrAwCQYDVR0TBAIwADANBgkqhkiG9w0BA
QUFAAOCAQEAABb3RnPlwEBNKEWy3YsFRwJSZoMTBGwv7Q0sWf9nTHMS3vgFqNUSx8iqP99tnoppav7Td
WoQ5zBtW935Nkev7rhqGADT4R/7pYeYc2R+Yjsbn6rxo6zDv/oIrd8LtFHccx3iUYgt/n1J5QiGIQ601fXwYftua
VcaMnwsVBCuFy8vut4PiSPVsfML/R/oLQ3IqKJmNMXy4Rm8qjeOdgLyYwTuz7oKZ+N4+kq4tpuuJn86EUk3q
sQo+FOVfwFi7cew7qtDYHapqAC4zTb6isqB8/Wcagucb4zNU3Vgeixz5Nsd
8g28hcC/OzhHHGZpQvB0WVF5YlF1Od7AYBL+DDI9Lg==</X509Certificate>
<X509IssuerSerial>
<X509IssuerName>OU=DEMO,O=FINA,C=HR</X509IssuerName>
<X509SerialNumber>1053495513</X509SerialNumber>
</X509IssuerSerial>
</X509Data>
</KeyInfo>
</Signature>
</tns:RacunZahtjev>
</soapenv:Body>
</soapenv:Envelope>